yelp_clone/app/views/restaurants/index.html.erb

      <ul>
        <% restaurant.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 3]]

            <%= link_to "Endorse Review", review_endorsements_path(review), class: 'endorsements-link' %>
            <span class="endorsements_count"> <%= review.endorsements.count %> </span> <%= 'endorsement'.pluralize(review.endorsements.count) %>
---
SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."review_id" = $1  [["review_id", 4]]