yelp_clone/app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "mcdonalds"], ["description", "greasy"], ["created_at", "2017-01-11 10:09:23.800489"], ["updated_at", "2017-01-11 10:09:23.800489"]]

  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "restaurants" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "restaurants"."id" = $4  [["name", "Kentucky Fried Chicken"], ["description", "Deep Fried Goodness"], ["updated_at", "2017-01-11 10:36:08.278328"], ["id", 1]]