yelp_clone/app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("thoughts", "rating", "user_id", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "yummy and crispy"], ["rating", 3], ["user_id", 1], ["restaurant_id", 4], ["created_at", "2017-01-16 15:32:14.164940"], ["updated_at", "2017-01-16 15:32:14.164940"]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = @restaurant.reviews.build_with_user review_params, current_user

    if @review.save